modules_core/com.etendorx.das/src/test/resources/jsons/invoice.write.json

{
  "accountingDate": "2011-02-15 00:00:00",
  "bussinespartner_info": {
    "name": "Restaurantes Luna Llena, S.A.",
    "businessPartnerCategory": "Customer - Tier 2"
  },
  "client": "F&B International Group",
  "currency": "EUR",
  "docStatus": "CO",
  "documentNo": "1000008",
  "documentType": "AR Invoice",
  "documentType_info": {
    "id": "7FCD49652E104E6BB06C3A0D787412E3",
    "name": "AR Invoice"
  },
  "grossAmount": 1094615.2,
  "invoiceDate": "2011-02-15 00:00:00",
  "isReturn": false,
  "isSale": true,
  "legalOrganization": "F&B España, S.A",
  "legalOrganization_info": {
    "name": "F&B España, S.A"
  },
  "lines": [
    {
      "lineNo": 10,
      "product": "ES/0024",
      "product_info": {
        "name": "Agua sin Gas 1L",
        "id": "BDE2F1CF46B54EF58D33E20A230DA8D2"
      },
      "invoicedQuantity": 25000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 1.53,
      "grossAmount": 0,
      "netAmount": 38250,
      "grossListPrice": 0,
      "netListPrice": 1.53,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 38250,
          "taxAmount": 6885,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 1.53,
      "priceLimit": 0,
      "lineNetAmount": 38250
    },
    {
      "lineNo": 20,
      "product": "ES/0021",
      "product_info": {
        "name": "Bebida Energética 0,5L",
        "id": "C11ECF6EF3BC4240B374DD5A76163A85"
      },
      "invoicedQuantity": 45000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 1.49,
      "grossAmount": 0,
      "netAmount": 67050,
      "grossListPrice": 0,
      "netListPrice": 1.49,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 67050,
          "taxAmount": 12069,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 1.49,
      "priceLimit": 0,
      "lineNetAmount": 67050
    },
    {
      "lineNo": 30,
      "product": "ES/0001",
      "product_info": {
        "name": "Cerveza Ale 0,5L",
        "id": "DA7FC1BB3BA44EC48EC1AB9C74168CED"
      },
      "invoicedQuantity": 33000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 2.04,
      "grossAmount": 0,
      "netAmount": 67320,
      "grossListPrice": 0,
      "netListPrice": 2.04,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 67320,
          "taxAmount": 12117.6,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 2.04,
      "priceLimit": 0,
      "lineNetAmount": 67320
    },
    {
      "lineNo": 40,
      "product": "ES/0002",
      "product_info": {
        "name": "Cerveza Lager 0,5L",
        "id": "C0E3824CC5184B7F9746D195ACAC2CCF"
      },
      "invoicedQuantity": 45000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 2.64,
      "grossAmount": 0,
      "netAmount": 118800,
      "grossListPrice": 0,
      "netListPrice": 2.64,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 118800,
          "taxAmount": 21384,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 2.64,
      "priceLimit": 0,
      "lineNetAmount": 118800
    },
    {
      "lineNo": 50,
      "product": "ES/0019",
      "product_info": {
        "name": "Cola 0,5L",
        "id": "7206FAA45A3842659D93F59CCA2B0613"
      },
      "invoicedQuantity": 33000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 0.83,
      "grossAmount": 0,
      "netAmount": 27390,
      "grossListPrice": 0,
      "netListPrice": 0.83,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 27390,
          "taxAmount": 4930.2,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 0.83,
      "priceLimit": 0,
      "lineNetAmount": 27390
    },
    {
      "lineNo": 60,
      "product": "ES/0018",
      "product_info": {
        "name": "Cola de Cereza 0,5L",
        "id": "C790C795FFC74E8F9789E65FFEA4F1EF"
      },
      "invoicedQuantity": 40000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 0.83,
      "grossAmount": 0,
      "netAmount": 33200,
      "grossListPrice": 0,
      "netListPrice": 0.83,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 33200,
          "taxAmount": 5976,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 0.83,
      "priceLimit": 0,
      "lineNetAmount": 33200
    },
    {
      "lineNo": 70,
      "product": "ES/0022",
      "product_info": {
        "name": "Limonada 0,5L",
        "id": "3BD16BA206D24E41B56E0964854220EA"
      },
      "invoicedQuantity": 47000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 0.83,
      "grossAmount": 0,
      "netAmount": 39010,
      "grossListPrice": 0,
      "netListPrice": 0.83,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 39010,
          "taxAmount": 7021.8,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 0.83,
      "priceLimit": 0,
      "lineNetAmount": 39010
    },
    {
      "lineNo": 80,
      "product": "ES/0005",
      "product_info": {
        "name": "Vino Blanco 0,75L",
        "id": "20EA4222B741434A9203471A3B29C343"
      },
      "invoicedQuantity": 56000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 5.33,
      "grossAmount": 0,
      "netAmount": 298480,
      "grossListPrice": 0,
      "netListPrice": 5.33,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 298480,
          "taxAmount": 53726.4,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 5.33,
      "priceLimit": 0,
      "lineNetAmount": 298480
    },
    {
      "lineNo": 90,
      "product": "ES/0004",
      "product_info": {
        "name": "Vino Rosado 0,75L",
        "id": "B3D8E5B7C9924F96A26D21ACA275D5C4"
      },
      "invoicedQuantity": 12000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 5.63,
      "grossAmount": 0,
      "netAmount": 67560,
      "grossListPrice": 0,
      "netListPrice": 5.63,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 67560,
          "taxAmount": 12160.8,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 5.63,
      "priceLimit": 0,
      "lineNetAmount": 67560
    },
    {
      "lineNo": 100,
      "product": "ES/0003",
      "product_info": {
        "name": "Vino Tinto 0,75L",
        "id": "FDDBB89508D24D2C8D97A2A57BEA8788"
      },
      "invoicedQuantity": 13000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 5.18,
      "grossAmount": 0,
      "netAmount": 67340,
      "grossListPrice": 0,
      "netListPrice": 5.18,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 67340,
          "taxAmount": 12121.2,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 5.18,
      "priceLimit": 0,
      "lineNetAmount": 67340
    },
    {
      "lineNo": 110,
      "product": "ES/0007",
      "product_info": {
        "name": "Zumo de Naranja Bio 0,33L",
        "id": "61047A6B06B3452B85260C7BCF08E78D"
      },
      "invoicedQuantity": 45000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 1.34,
      "grossAmount": 0,
      "netAmount": 60300,
      "grossListPrice": 0,
      "netListPrice": 1.34,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 60300,
          "taxAmount": 10854,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 1.34,
      "priceLimit": 0,
      "lineNetAmount": 60300
    },
    {
      "lineNo": 120,
      "product": "ES/0013",
      "product_info": {
        "name": "Zumo de Pera 0,5L",
        "id": "F8383209982D467EBAA87460953694D1"
      },
      "invoicedQuantity": 25000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 1.13,
      "grossAmount": 0,
      "netAmount": 28250,
      "grossListPrice": 0,
      "netListPrice": 1.13,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 28250,
          "taxAmount": 5085,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 1.13,
      "priceLimit": 0,
      "lineNetAmount": 28250
    },
    {
      "lineNo": 130,
      "product": "ES/0014",
      "product_info": {
        "name": "Zumo de Piña 0,5L",
        "id": "C970393BDF6C43E2B030D23482D88EED"
      },
      "invoicedQuantity": 13000,
      "uOM": "EA",
      "grossUnitPrice": 0,
      "netUnitPrice": 1.13,
      "grossAmount": 0,
      "netAmount": 14690,
      "grossListPrice": 0,
      "netListPrice": 1.13,
      "taxCategory": "IVA Normal",
      "taxes": [
        {
          "lineNo": 10,
          "tax": "Entregas IVA 18%",
          "rate": 18,
          "taxableAmount": 14690,
          "taxAmount": 2644.2,
          "docTaxAmount": "D"
        }
      ],
      "discount_info": [],
      "unitPrice": 1.13,
      "priceLimit": 0,
      "lineNetAmount": 14690
    }
  ],
  "netAmount": 927640,
  "order": "1000004",
  "organization": "F&B España - Región Sur",
  "organization_info": {
    "taxID": "?",
    "name": "F&B España - Región Sur"
  },
  "partnerAddress": "Sevilla, Pl. Mayor, 78",
  "partnerAddress_info": {
    "address": "Pl. Mayor, 78",
    "city": "Sevilla",
    "postalCode": "76746",
    "countryCode": "ES",
    "region": "SEVILLA ",
    "name": "Sevilla, Pl. Mayor, 78",
    "id": "6F0E64374DA9411CA39E8F059ACD8E1B"
  },
  "paymentMethod": "Transferencia",
  "paymentTerms_info": {
    "id": "66BA1164A7394344BB9CD1A6ECEED05D",
    "name": "30 days"
  },
  "priceIncludesTax": false,
  "priceList": "Tarifa de ventas",
  "priceList_info": {
    "id": "AEE66281A08F42B6BC509B8A80A33C29",
    "client": "F&B International Group",
    "organization": "F&B España, S.A",
    "organization_info": {
      "name": "F&B España, S.A",
      "searchKey": "F&B España, S.A",
      "currency_info": {
        "id": "102"
      },
      "id": "B843C30461EA4501935CB1D125C9C25A"
    },
    "name": "Tarifa de ventas",
    "currency": "EUR",
    "active": true,
    "enforcePriceLimit": false,
    "taxIncluded": false,
    "default": false,
    "salesPriceList": true,
    "costBased": false,
    "priceListVersions": [
      {
        "id": "FDE536FE9D8C4B068C32CD6C3650B6B8",
        "name": "Tarifa de ventas",
        "validFromDate": "2011-01-01 00:00:00.0"
      }
    ]
  },
  "taxes": [
    {
      "lineNo": 10,
      "tax": "Entregas IVA 18%",
      "rate": 18,
      "taxableAmount": 927640,
      "taxAmount": 166975.2,
      "docTaxAmount": "D"
    }
  ],
  "transactionDocument_info": {
    "id": "7FCD49652E104E6BB06C3A0D787412E3",
    "name": "AR Invoice"
  }
}
